import numpy as np
"""归一话实现"""
# 创建100个整数
x = np.random.randint(0,100,size=100)
print(x)
print("**************************我是分隔符*******************************")

# 最值归一化（向量）
# 最值归一化公式，映射0，1之间
print((x-np.min(x))/(np.max(x)-np.min(x)))
print("**************************我是分隔符*******************************")



# 最值归一化（矩阵）
# 0~100 范围内的50*2的矩阵
X = np.random.randint(0,100,(50,2))

# 将矩阵改为浮点型
X = np.array(X,float)
print(X)
print("**************************我是分隔符*******************************")

# 最值归一化公式，对于每一个维度（列方向）进行归一化
# X[:,0] 第一列，第一个特征
print(X[:,0])
print("**************************我是分隔符*******************************")
X[:,0] = (X[:,0] - np.min(X[:,0]))/(np.max(X[:,0])-np.min(X[:,0]))
print(X[:,0])
print("**************************我是分隔符*******************************")

# X[:,1] 第二列，第二个特征
X[:,1] = (X[:,1] - np.min(X[:,1])) / (np.max(X[:,1]) - np.min(X[:,1]))
print(X[:,1])

# 简单绘制样本，看横纵坐标
import matplotlib.pyplot as plt

plt.scatter(X[:,0],X[:,1])
plt.show()




































